000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаПродюсеры/КафкаПродюсеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаПродюсеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАсинх</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетнуюПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсьюмерПроверки</name>
    <type>
      <types>CatalogRef.КафкаКонсьюмеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыПродюсера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Топики</name>
    <attributes>
      <name>Топик</name>
      <type>
        <types>CatalogRef.КафкаТопики</types>
      </type>
    </attributes>
    <attributes>
      <name>Порция</name>
      <comment>Количество сообщений для отправки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаБрокеры/КафкаБрокеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаБрокеры</name>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПодключения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимПароля</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаПродюсеры/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание продюсера.
// 
// Параметры:
//  Продюсер - СправочникСсылка.КафкаПродюсеры - Экземпляр продюсера
// 
// Возвращаемое значение:
//  Структура - Описание продюсера:
// * Ссылка - СправочникСсылка.КафкаПродюсеры - Ссылка
// * Наименование - Строка - Наименование
// * АдресБрокера - Строка - Адрес брокера
// * РежимАсинх - Булево - Режим асинхронной отправки
// * ПараметрыПодключения - Соответствие Из Строка - Параметры подключения брокера и продюсера
Функция ОписаниеПродюсера(Продюсер) Экспорт
	
	Результат = НовоеОписаниеПродюсера();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПродюсеры.Ссылка,
	|	кфкПродюсеры.Наименование,
	|	кфкПродюсеры.Брокер,
	|	кфкПродюсеры.РежимАсинх
	|ИЗ
	|	Справочник.КафкаПродюсеры КАК кфкПродюсеры
	|ГДЕ
	|	кфкПродюсеры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	кфкПродюсерыПараметрыПродюсера.Ключ,
	|	кфкПродюсерыПараметрыПродюсера.Значение
	|ИЗ
	|	Справочник.КафкаПродюсеры.ПараметрыПродюсера КАК кфкПродюсерыПараметрыПродюсера
	|ГДЕ
	|	кфкПродюсерыПараметрыПродюсера.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Продюсер);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	ВыборкаПараметры = РезультатЗапроса[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДоступныеБрокеры = Справочники.КафкаБрокеры.ДоступныеБрокеры();
		Брокер = ДоступныеБрокеры.Получить(Выборка.Брокер);
		Если Брокер = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗаполнитьЗначенияСвойств(Результат, Брокер, "АдресБрокера,ПараметрыПодключения");
		
		Пока ВыборкаПараметры.Следующий() Цикл
			Результат.ПараметрыПодключения.Вставить(ВыборкаПараметры.Ключ, ВыборкаПараметры.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Объекты метаданных участвующие в интеграции с Kafka/
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие Из Строка - Объекты интеграции
Функция ОбъектыИнтеграции() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка КАК Ссылка,
	|	кфкПродюсерыОбъектыМетаданных.ТипОбъект КАК ТипОбъект
	|ИЗ
	|	Справочник.КафкаПродюсеры КАК кфкПродюсеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаПродюсеры.ОбъектыМетаданных КАК кфкПродюсерыОбъектыМетаданных
	|		ПО кфкПродюсеры.Ссылка = кфкПродюсерыОбъектыМетаданных.Ссылка
	|ГДЕ
	|	кфкПродюсеры.ПометкаУдаления = ЛОЖЬ
	|	И кфкПродюсеры.БлокироватьРегистрацию = ЛОЖЬ
	|ИТОГИ
	|ПО
	|	ТипОбъект";
	ВыборкаОМ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОМ.Следующий() Цикл
		
		Продюсеры = ОбщегоНазначения.ВыбратьКолонку(ВыборкаОМ.Выбрать(), "Ссылка"); // Массив Из СправочникСсылка.КафкаПродюсеры
		Результат.Вставить(ВыборкаОМ.ТипОбъект, Новый ФиксированныйМассив(Продюсеры));
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Возвращает правила сериализации для указанных продюсеров.
//
// Параметры:
//	Продюсеры - Массив Из СправочникСсылка.КафкаПродюсеры - список ссылок на продюсеров
//
// Возвращаемое значение:
//	Соответствие Из Строка - словарь сериализации:
//	 * Ключ - Строка - Продюсер + ТипОбъект
//	 * Значение - Структура - Описание сериализации, см. кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена
Функция ПравилаСериализации(Продюсеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка КАК Ссылка,
	|	кфкПродюсерыОбъектыМетаданных.ТипОбъект КАК ТипОбъект,
	|	кфкПродюсерыОбъектыМетаданных.ТипСериализации КАК Тип,
	|	кфкПродюсерыОбъектыМетаданных.ИмяМетодаСериализации КАК ИмяМетода,
	|	кфкПродюсерыОбъектыМетаданных.ИмяМодуляСериализации КАК ИмяМодуля,
	|	кфкПродюсерыОбъектыМетаданных.ИмяПОДСериализации КАК ИмяПОД,
	|	кфкПродюсерыОбъектыМетаданных.ФорматСериализации КАК Формат
	|ИЗ
	|	Справочник.КафкаПродюсеры.ОбъектыМетаданных КАК кфкПродюсерыОбъектыМетаданных
	|ГДЕ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка В (&Продюсеры)";
	Запрос.УстановитьПараметр("Продюсеры", Продюсеры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
//		Описание = кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена();
//		ЗаполнитьЗначенияСвойств(Описание, Выборка);
//		
//		// TODO: КД - Обратная совместимость
//		Если Описание.Тип.Пустая() И Не ПустаяСтрока(Описание.ИмяМетода)
//				И ПустаяСтрока(Описание.ИмяМодуля + Описание.ИмяПОД + Описание.Формат) Тогда
//			Описание.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
//		КонецЕсли;
//		
//		Результат.Вставить(НРег(XMLСтрока(Выборка.Ссылка) + Выборка.ТипОбъект), Описание);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает топики для указанных продюсеров.
//
// Параметры:
//	Продюсеры - Массив Из СправочникСсылка.КафкаПродюсеры - список ссылок на продюсеров
//
// Возвращаемое значение:
//	Соответствие Из Строка - словарь, где ключ - строка, объединяющая ссылку на продюсер и тип объекта, а значение - имя топика
Функция Топики(Продюсеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка КАК Ссылка,
	|	кфкПродюсерыОбъектыМетаданных.ТипОбъект КАК ТипОбъект,
	|	кфкПродюсерыОбъектыМетаданных.ИмяТопика КАК ИмяТопика
	|ИЗ
	|	Справочник.КафкаПродюсеры.ОбъектыМетаданных КАК кфкПродюсерыОбъектыМетаданных
	|ГДЕ
	|	кфкПродюсерыОбъектыМетаданных.Ссылка В (&Продюсеры)";
	Запрос.УстановитьПараметр("Продюсеры", Продюсеры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(НРег(XMLСтрока(Выборка.Ссылка) + Выборка.ТипОбъект), Выборка.ИмяТопика);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовоеОписаниеПродюсера()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("Наименование", "");
	Результат.Вставить("АдресБрокера", "");
	Результат.Вставить("РежимАсинх", Ложь);
	Результат.Вставить("ПараметрыПодключения", Новый Соответствие);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли
